Yourigh/A_light/3 - FW SW/2 - Alarm Clock FW ESP8266/_190104_ESP8266_Alight_gitted/src/Alight_main.cpp
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <WiFiClient.h>
#include <EEPROM.h>
#include <Ticker.h>
#include <ESP8266httpUpdate.h>
#include <TimeLib.h>
#define FASTLED_ESP8266_RAW_PIN_ORDER
#define FASTLED_ALLOW_INTERRUPTS 0 //to avoid flickering
#include "FastLED.h"
//#define RTC_DS3231
//#define RTC_DS1307
#define NTP_TIME

#ifdef RTC_DS3231
  #include <DS3231.h>
#endif
#ifdef RTC_DS1307
  #include <RtcDS1307.h>
#endif
#include <Wire.h>
#include "JR_FastLed_alarm_clock.h"
#include <SparkFun_MMA8452Q.h> // Includes the SFE_MMA8452Q library
#include <core_esp8266_i2s.h>
#include "i2s_reg.h"
#ifdef NTP_TIME
  #include "NTPClient.h"
  #include "WiFiUdp.h"
#endif

#define VERSION "V1.4"
//V1.0 200205 added more delays to ext trigger
//V1.1 added clock show yellow while in alarm shine mode
//V1.2 added internet time NTP client, added summer time commands and menu on default webpage
//V1.3 night mode edits, hour always only one LED on
//V1.4 middle LED at night on a bit.

// Define the array of leds
CRGB leds[NUM_LEDS_M + NUM_LEDS_H + SACRIFICIAL_LED];

//accelerometer
MMA8452Q accel;

byte br = 0; //alarm brightness begin
//ADC
uint16_t LightValue = 0;        // value read from the light sensor


//WEB stuff
String chip_id;
MDNSResponder mdns;
IPAddress ip;
const int req_buffer_size = 20;
String req_value_buf[req_buffer_size];
String req_name_buf[req_buffer_size];

WiFiServer server(80);
bool summer_mode = false;

#define WIFI_RECONNECT_START_INTERVAL_MS 30000UL
#define WIFI_RECONNECT_MAX_INTERVAL_MS 1800000UL
#define WIFI_RECONNECT_TIMEOUT_MS 25000UL

bool wifi_reconnect_in_progress = false;
unsigned long wifi_reconnect_started_ms = 0;
unsigned long wifi_next_reconnect_ms = 0;
unsigned long wifi_reconnect_interval_ms = WIFI_RECONNECT_START_INTERVAL_MS;
byte wifi_reconnect_failures = 0;

TimeElements tm;
unsigned long last_update_time;
#ifdef RTC_DS3231
  DS3231 Clock;
#endif
#ifdef RTC_DS1307
  RtcDS1307<TwoWire> Rtc(Wire);
#endif
#ifdef NTP_TIME
  const long utcOffsetInSeconds = 3600;//19800;
  // Define NTP Client to get time
  WiFiUDP ntpUDP;
  NTPClient timeClient(ntpUDP, "pool.ntp.org", utcOffsetInSeconds);
#endif

bool h12=false;
bool PM;
bool Century=false;

//time stuff
#define ALARM_STEP_BRIGHTNESS_MS 1000
byte Alarm_buffer[40]; //4 items per alarm, 10 alarms available
#define ALARM_MEMORY_OFFSET 256
#define SUMMERTIME_MEMORY_OFFSET 300
bool Alarm_shining = false;
#define ALARM_TIMEOUT_MS 3600000 // from start of alarm, one hour, has to be more than 60s
unsigned long alarm_timeout_from_ms = 0;



//FUNCTION PROTOTYPES
void check_reset_button();
void program_restart();
void time_show(byte rot,byte status_led); //rotation and status led (middle one) - 0xRGB full intensity
void alarm_shine();

void launchWeb(int webtype); //webtype 1 = AP host, 0 = guest



void req_inter(String in); //split recevied string to command and value and put to global buffers
void http_update_handle(String req);
int mdns1(int webtype, String WifiList);//main web function that do everything. responds to requests etc..
void wifi_reconnect_task(String esid, String epass, byte *webtype, String *WifiList);
byte getOrientation(void);
byte clock_face_rotation = 0;

#if defined(RTC_DS1307) || defined(RTC_DS3231)
  time_t RTC_time_read();
#endif
#ifdef NTP_TIME
  time_t NTP_time_read();
#endif

bool check_alarm();
void delete_alarm(byte Alarm_ID);

void setup() {
  if (WiFi.status() == WL_CONNECTED)  WiFi.disconnect();
  delay(100);
  chip_id = String(ESP.getFlashChipId()); //get Chip ID, used for AP SSID name
  //FastLED
  FastLED.addLeds<WS2812, DATA_PIN_LED_M_H, GRB>(leds, NUM_LEDS_M + NUM_LEDS_H + SACRIFICIAL_LED);//GBR?

  last_update_time = millis(); //for clock second tick
  
  ESP_on_board_LED_off(); //turn off on board LED so it does not interfere with Light sensor

  #ifdef DEBUG
    //Enable Serial TX only, RX is used for i2s DAC
    Serial.begin(115200,SERIAL_8N1,SERIAL_TX_ONLY);
  #endif 
  
  // Start the I2C interface
  Wire.begin(4,0);
  #ifdef RTC_DS1307
    Rtc.Begin();
    Rtc.SetSquareWavePin(DS1307SquareWaveOut_High); 
  #endif
  #if defined(RTC_DS1307) || defined(RTC_DS3231)
    setSyncProvider(RTC_time_read);
    setSyncInterval(30);//seconds
  #endif
  #ifdef NTP_TIME
    setSyncProvider(NTP_time_read);
    setSyncInterval(5);//seconds
  #endif

  //Enable EEPROM
  EEPROM.begin(512);
  delay(10);

  PRINTDEBUG(VERSION);
  PRINTDEBUG("...\nStartup");

  if(accel.init(SCALE_4G,ODR_400)==1)
    PRINTDEBUG("\nInit accelerometer OK!\n");
  else{
    LED_blink_all(leds,2,CRGB::Red);
    PRINTDEBUG("\nInit accelerometer NOK!\n");
  }
  clock_face_rotation = getOrientation();

  //for i2s sound generator
  i2s_begin();
  i2s_set_rate(22050);
  ESP_on_board_LED_off(); 

  //Output interface - external trigger for alarm
  pinMode(16,OUTPUT);
  pinMode(14,OUTPUT);
  pinMode(5,OUTPUT);
  pinMode(15,OUTPUT);
  digitalWrite(16,0);
  digitalWrite(14,0);
  digitalWrite(5,0);
  digitalWrite(15,0);
  //now flipped at sync - will be used in alarm firing.

  // read eeprom for ssid and pass
  PRINTDEBUG("\nReading EEPROM");
  // Read SSID EEPROM
  String esid;
  for (int i = 0; i < 32; ++i)
  {
    esid += char(EEPROM.read(i));
  }
  PRINTDEBUG("\nSSID: "); PRINTDEBUG(esid);

  // Read password from EEPROM
  String epass = "";
  for (int i = 32; i < 96; ++i)
  {
    epass += char(EEPROM.read(i));
  }
  PRINTDEBUG("\nPASS: "); PRINTDEBUG(epass);

  PRINTDEBUG("\nAlarm Memory:");
  // Read Alarm memory to Alarm buffer from EEPROM
  for (int i = 0; i < 40; ++i)
  {
    Alarm_buffer[i] = EEPROM.read(i+ALARM_MEMORY_OFFSET);
    #if DEBUG == 1
      if ((i%4)==0) {PRINTDEBUG("\nAlarm #");PRINTDEBUG(1+((i)/4));PRINTDEBUG(":\t");}
      PRINTDEBUG(Alarm_buffer[i]);
      PRINTDEBUG(",\t");
    #endif
  }

  //read EEPROM summertime settings
  
  if (EEPROM.read(SUMMERTIME_MEMORY_OFFSET))
    timeClient.setTimeOffset(7200);
  else
    timeClient.setTimeOffset(3600);
  

  byte webtype = 0; //0 local, 1 AP
  String WifiList;
  if ((esid.length() > 2)) {
    // test esid from eeprom if more than 2 characters
    WiFi.begin(esid.c_str(), epass.c_str());
    //use DHCP, no IP address is set.

    if (testWifi(leds) == 20) { //20 connected, 10 not connected     this takes about ten seconds
      WiFi.mode(WIFI_STA);
      webtype = 0; //0 local, 1 AP
      #ifdef NTP_TIME
        timeClient.begin();
        timeClient.update();
      #endif
    } else {
      WifiList = scanWifi_list();
      setupAP(chip_id, true);
      webtype = 1; //web server on on AP
    }
  } else { //esid from EEPROM less than 2 chars..
    WifiList = scanWifi_list();
    setupAP(chip_id);
    webtype = 1; //web server on on AP
  }

