Yourigh/A_light/3 - FW SW/2 - Alarm Clock FW ESP8266/_190104_ESP8266_Alight_gitted/src/Alight_main.cpp
  launchWeb(webtype); //0 local, 1 AP
  
  int b = 20;
  while (b == 20) {
    b = mdns1(webtype,WifiList); //this function must run periodically always
    //if not return OK_VAL program stops
    check_reset_button();
    
    if (Alarm_shining){
      if (millis()-last_update_time>ALARM_STEP_BRIGHTNESS_MS){
        check_alarm();
        alarm_shine();
        last_update_time = millis();
      }
      if (accel.available()){
          if (accel.readTap()){
            //double tap event
            leds[0].setRGB(0,0,255);
            FastLED.show();
            last_update_time = millis(); //shine for ALARM_STEP_BRIGHTNESS_MS
            Alarm_shining = false;
          }
        }
    }else{ //alarm not shining
      if (accel.available()){
          if (accel.readTap()){
            //double tap event - turn on status LED
            leds[0].setRGB(0,255,0);
            FastLED.show();
            last_update_time = millis(); //shine 1 second
            while (millis()-last_update_time<2000)
            {//play for 2 seconds
              write_audio_sample(); 
            }
          }
        }
      
      br = 0;
      if (millis()-last_update_time>1000){//every second
        if (timeStatus()!=timeSet) //begins with 5 second interval to set the time quickly, but to keep track, 300s interval is ok. 300s is set in NTP_time_read.
          {setSyncInterval(5); setTime(NTP_time_read());}
        
         PRINTDEBUG(".");
         check_alarm(); //check alarm every second only
         last_update_time = millis();

         LightValue = exp_moving_average(LightValue,analogRead(A0)); //calculate average range 0 to 1024
         //clock face orientation read
         clock_face_rotation = getOrientation();  //can be less often
         uint8_t status_state = 0b000;
         if (webtype) 
          status_state = 0b100; //AP mode - red
         if ((summer_mode == 0) && (WiFi.status() != WL_CONNECTED))
          status_state = 0b110; //wifi lost - orange
        
         if (webtype)
          time_show(clock_face_rotation,(byte)0b100); //red status LED when AP mode (lost WiFi connection)
         else
          time_show(clock_face_rotation,(byte)0b000); 
        
         wifi_reconnect_task(esid, epass, &webtype, &WifiList);
      }//end every second
    }
  }
  PRINTDEBUG("Error in function mdns1, program stopped");
  LED_blink_all(leds,20,CRGB::Red);
  program_restart();
}
//---------------------------------------------END SETUP---------------------------------------------

void time_show(byte rot, byte status_led){
  float bright_on = LightValue / 1024.0; //0 to 1 range
  //PRINTDEBUG("L=");
  //PRINTDEBUG(bright_on);
  //PRINTDEBUG("\n");
  if (bright_on <= 0.02) bright_on = 0.00;
  byte hour12h;
  hour12h = hourFormat12();
  hour12h = (hour12h==12) ? 0 : hour12h; //noon or midnight is zero
  bool hour_array[12];
  bool minute_array[24];
  bool second_array[24];
  byte minute_show = minute();
  byte second_show = second();
  
  for(byte l=0;l<12;l++){
    //example: 11:30PM, only led at 11 position is ON
    //to limit light intensity in the night
    hour_array[l] = ((hour12h)==l); //true is shine
      
    if (hour()==12) //comparing 24h time
      hour_array[0]=true; //12h shine also at noon and midnight
    else
      hour_array[0]=false;
  }
  for(byte l=0; l<24; l++) {
    if (bright_on == 0.00)
      minute_array[l] = ((byte)(minute_show / 2.5) == l); //in total darkness, only one LED for minute
    else
      minute_array[l] = ((minute_show / 2.5) >= l);
    if (SHOW_SECONDS)
      second_array[l] = ((second_show / 2.5) >= l);
    else
      second_array[l] = false;
  }
  byte lr;
  for(byte l=0;l<12;l++){ //loop for hour ring
    //face rotation, rotate by 3LEDS * rot, lr is index that is rotated
    lr = l+(3*rot);
    if (lr>11) lr = lr-12;
    //LEDs array
    uint8_t intensityR = (bright_on == 0.00) ? (uint8_t)hour_array[l] : 0; //in total darkness, tiny bit of red light
    uint8_t intensityG = (0+(uint16_t)(bright_on*128.0))*(uint16_t)hour_array[l]; //when dark, if off (0 offset)
    uint8_t intensityB = 0;
    leds[lr+NUM_LEDS_M + SACRIFICIAL_LED].setRGB(intensityR,intensityG,intensityB);
  }
  for(byte l=0;l<24;l++){ //loop for minutes and seconds
    //face rotation, rotate by 6LEDS * rot
    lr = l+(6*rot);
    if (lr>23) lr = lr-24;
    //LEDs array
    uint8_t intensityR = (1+(uint16_t)(bright_on*96.0))*(uint16_t)minute_array[l];  //was 4+
    uint8_t intensityG = (0+(uint16_t)(bright_on*96.0))*(uint16_t)minute_array[l];  //was 3+
    uint8_t intensityB = (0+(uint16_t)(bright_on*8.0))*(uint16_t)second_array[l];  //was 3+
    leds[lr+SACRIFICIAL_LED].setRGB(intensityR,intensityG,intensityB);
  }
  if (bright_on == 0.00){
    if (status_led==0)
      leds[0].setRGB(0,1,0); //tiny bit of green in total darkness
    else
      leds[0].setRGB(1*((status_led&0b100)>>2),1*((status_led&0b010)>>1),1*(status_led&0b001));
  } else {
    leds[0].setRGB(255*((status_led&0b100)>>2),255*((status_led&0b010)>>1),255*(status_led&0b001));
  }
  FastLED.show();
}

//////////////////////////////////////////////////////////////////
///////////TIME functions ////////////////////////////////////////
//////////////////////////////////////////////////////////////////

void alarm_shine(){
  if (br<255) {
      br++; //rise to full intensity
  }
  fill_solid( leds, NUM_LEDS_H + NUM_LEDS_M + SACRIFICIAL_LED, CRGB(br,br,br));
  leds[0].setRGB(0,0,0);
  //section turn off hour and minute LED of currnet time
  static byte cfrot = getOrientation();  //can be less often
  byte hour12h;
  hour12h = hourFormat12();
  hour12h = (hour12h==12) ? 0 : hour12h; //noon or midnight is zero
  byte timeled_index = 0;
  timeled_index = hour12h;
  timeled_index = timeled_index+(3*cfrot); //rotation
  if (timeled_index>11) timeled_index = timeled_index-12; //rotation
  leds[timeled_index+NUM_LEDS_M + SACRIFICIAL_LED].setRGB(255,255,0); //hours
  byte minute_show = minute();
  timeled_index = (byte)(minute_show/2.5);
  timeled_index = timeled_index+(6*cfrot); //rotation
  if (timeled_index>23) timeled_index = timeled_index-24; //rotation
  leds[timeled_index+SACRIFICIAL_LED].setRGB(255,255,0); //minutes
  //LED for time are off
  FastLED.show();
  //PRINTDEBUG("\nBright:");
  //PRINTDEBUG(br);
  //trigger external light
  if (br == 5) ext_trigger(PIN_TRG_KEY1);
  if (br == 64) ext_trigger(PIN_TRG_KEY2);
  if (br == 180) ext_trigger(PIN_TRG_KEY4);
  if (br == 254) {ext_trigger(PIN_TRG_ONOFF); delay(1500); ext_trigger(PIN_TRG_ONOFF);}
}

//---------------------------------
//--------WEB FUNCTIONS------------
//---------------------------------

void check_reset_button(){
    if (!digitalRead(D3)) //button pressed
    {
      LED_blink_all(leds,1,CRGB::Yellow);
      program_restart();
    }
}

void program_restart(){
  
  Alarm_shining = false;
  br = 0; //alarm brightness begin
  for (int i=0;i<40;i++)
    Alarm_buffer[i] = 0;
  String chip_id = String(ESP.getFlashChipId());
  if (WiFi.status() == WL_CONNECTED)  WiFi.disconnect();
  PRINTDEBUG("\nTrying ESP.restart..");
  ESP.restart(); //CHECK if it is all ok
  PRINTDEBUG("\nAfter ESP.restart..");
  delay(100);
  PRINTDEBUG("\nExecuting setup...");
  setup();
}

void launchWeb(int webtype) {
  PRINTDEBUG("\nWiFi connected : ");
  if (webtype) {
    PRINTDEBUG("\nAP SSID:");
    PRINTDEBUG(AP_SSID);
    PRINTDEBUG(chip_id);
    PRINTDEBUG("\nPASS: ");
    PRINTDEBUG(AP_PASS);
    PRINTDEBUG("\nIP: ");
    ip = WiFi.softAPIP();
  } else {
    PRINTDEBUG("\nLocal WiFi, IP: ");
    ip = WiFi.localIP();
  }
  PRINTDEBUG(ip);
  
