Yourigh/A_light/3 - FW SW/2 - Alarm Clock FW ESP8266/_190104_ESP8266_Alight_gitted/src/Alight_main.cpp
  delay(100);
  if (!mdns.begin("Alight",ip)) {
    PRINTDEBUG("\nError setting up MDNS responder! deadlock, restarting");
    LED_blink_all(leds,20,CRGB::Red);
    program_restart();
    }
  PRINTDEBUG("\nmDNS responder started");
  // Start the server
  server.begin();
  mdns.addService("http","tcp",80);
  PRINTDEBUG("\nServer started");
  delay(100);
}

void wifi_reconnect_task(String esid, String epass, byte *webtype, String *WifiList) {
  if (summer_mode || esid.length() <= 2) {
    return;
  }

  if (WiFi.status() == WL_CONNECTED) {
    if (wifi_reconnect_in_progress || wifi_reconnect_failures > 0 || *webtype == 1) {
      PRINTDEBUG("\nWiFi reconnected, local IP: ");
      PRINTDEBUG(WiFi.localIP());
      LED_blink_all(leds,3,CRGB::Green);
    }
    wifi_reconnect_in_progress = false;
    wifi_reconnect_failures = 0;
    wifi_reconnect_interval_ms = WIFI_RECONNECT_START_INTERVAL_MS;
    wifi_next_reconnect_ms = 0;
    if (*webtype == 1) {
      WiFi.softAPdisconnect(true);
      WiFi.mode(WIFI_STA);
      *webtype = 0;
      #ifdef NTP_TIME
        timeClient.begin();
        timeClient.update();
      #endif
    }
    return;
  }

  unsigned long now_ms = millis();
  if (!wifi_reconnect_in_progress) {
    if (wifi_next_reconnect_ms != 0 && (long)(now_ms - wifi_next_reconnect_ms) < 0) {
      return;
    }

    PRINTDEBUG("\nWiFi disconnected, reconnect attempt ");
    PRINTDEBUG(wifi_reconnect_failures + 1);
    PRINTDEBUG(", interval ms: ");
    PRINTDEBUG(wifi_reconnect_interval_ms);

    WiFi.mode((*webtype == 1) ? WIFI_AP_STA : WIFI_STA);
    WiFi.disconnect();
    delay(50);
    WiFi.begin(esid.c_str(), epass.c_str());
    wifi_reconnect_started_ms = millis();
    wifi_reconnect_in_progress = true;
    LED_blink_all(leds,1,CRGB::Orange);
    return;
  }

  wl_status_t status = WiFi.status();
  if (status == WL_CONNECTED) {
    return; //handled on the next pass so the success path stays in one place
  }

  bool failed_status = (status == WL_NO_SSID_AVAIL) || (status == WL_CONNECT_FAILED);
  bool timed_out = (millis() - wifi_reconnect_started_ms) > WIFI_RECONNECT_TIMEOUT_MS;
  if (!failed_status && !timed_out) {
    return;
  }

  PRINTDEBUG("\nWiFi reconnect failed, status: ");
  PRINTDEBUG(status);

  WiFi.disconnect();
  wifi_reconnect_in_progress = false;
  wifi_reconnect_failures++;

  if (*webtype == 0) {
    *WifiList = scanWifi_list();
    setupAP(chip_id, true);
    *webtype = 1;
  }

  wifi_next_reconnect_ms = millis() + wifi_reconnect_interval_ms;
  if (wifi_reconnect_interval_ms < 60000UL) {
    wifi_reconnect_interval_ms = 60000UL;
  } else if (wifi_reconnect_interval_ms < 300000UL) {
    wifi_reconnect_interval_ms *= 2;
  } else if (wifi_reconnect_interval_ms < WIFI_RECONNECT_MAX_INTERVAL_MS) {
    wifi_reconnect_interval_ms *= 2;
    if (wifi_reconnect_interval_ms > WIFI_RECONNECT_MAX_INTERVAL_MS) {
      wifi_reconnect_interval_ms = WIFI_RECONNECT_MAX_INTERVAL_MS;
    }
  }
}


void req_inter(String in) //split recevied string to command and value and put to global buffers
{
  int i = 0;
  // Read each command pair
  // Length (with one extra character for the null terminator)
  int str_len = in.length() + 1;

  // Prepare the character array (the buffer)
  char input[str_len];

  // Copy it over
  in.toCharArray(input, str_len);
  char* command = strtok(input, "&");
  while (command != 0)
  {
    // Split the command in two values
    char* separator = strchr(command, '=');
    if (separator != 0)
    {
      // Actually split the string in 2: replace ':' with 0
      *separator = 0;
      req_name_buf[i] = command; //write command to this GLOBAL buffer
      ++separator;
      req_value_buf[i++] = separator; //value to this GLOBAL buffer
    }
    // Find the next command in input string
    command = strtok(0, "&");
  }
}

void http_update_handle(String req) {
  String t = "/a?";
  req = req.substring(t.length());
  req_inter(req);
  PRINTDEBUG(req_name_buf[0]);
  PRINTDEBUG(req_value_buf[0]);
  WiFiClient updateClient;
  t_httpUpdate_return ret = ESPhttpUpdate.update(updateClient, req_value_buf[0]);
  switch (ret) {
    case HTTP_UPDATE_FAILED:
      Serial.printf("HTTP_UPDATE_FAILD Error (%d): %s", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
      break;

    case HTTP_UPDATE_NO_UPDATES:
      PRINTDEBUG("HTTP_UPDATE_NO_UPDATES");
      break;

    case HTTP_UPDATE_OK:
      PRINTDEBUG("HTTP_UPDATE_OK");
      break;
  }
}

int mdns1(int webtype, String WifiList) //main web function that do everything. responds to requests etc..
//if returned OK_VAL, everything is ok, ERROR_VAL is bad
{
  // Check for any mDNS queries and send responses
  mdns.update();
  WiFiClient client = server.available();
  if (!client) {
    return OK_VAL;
  }
  PRINTDEBUG("");
  PRINTDEBUG("\n\nNew client request: ");
  String req = client.readStringUntil('\r');
  PRINTDEBUG(req);
  // Wait for data from client to become available
  if (client.connected() && !client.available()) {
    PRINTDEBUG("\nGone");
    return OK_VAL;
  }

  // Read the first line of HTTP request

  // First line of HTTP request looks like "GET /path HTTP/1.1"
  // Retrieve the "/path" part by finding the spaces
  int addr_start = req.indexOf(' ');
  int addr_end = req.indexOf(' ', addr_start + 1);
  if (addr_start == -1 || addr_end == -1) {
    Serial.print("\nInvalid request: ");
    PRINTDEBUG(req);
    return OK_VAL;
  }
  req = req.substring(addr_start + 1, addr_end);
  Serial.print("\nRequest: ");
  PRINTDEBUG(req);
  client.flush();

  String s;
  int commaIndex[6];
  String temp;
  

  if ( webtype == 1 ) {
    PRINTDEBUG(req);
    if (req == "/")
    {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>A_light";
      s += "<p>";
      s += "<form method='get' action='a'><label>SSID: </label><input name='ssid' length=32><label><br><br>PASS: </label><input name='pass' length=64><label><br><br><input type='submit'><br><br>";
      s += WifiList;
      s += "</form>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      LED_blink_all(leds,1,CRGB::Blue);
    }
    else if ( req.startsWith("/a?ssid=") ) {
      String t = "/a?";
      req = req.substring(t.length());
      req_inter(req);
      for (int i = 0; i < 2; i++)
      {
        PRINTDEBUG("\n");
        PRINTDEBUG(req_name_buf[i]);
        PRINTDEBUG(": ");
        PRINTDEBUG(req_value_buf[i]);
      }

      String qsid = req_value_buf[0];
      String qpass = req_value_buf[1];

      if (qsid.length()<2)
      {
        PRINTDEBUG("\nSSID entered is too short! values are not changed");
        //message stating credentials saved with restart button
        s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>Local ";
        s += "WiFi credentials NOT saved! (SSID too short)<br><br><a href=\"";
        s += "restart";
        s += "\"><button>Restart!</button></a>";
        s += "<p></p></html>\r\n\r\n";
        LED_blink_all(leds,1,CRGB::Red);
      }else{
        qsid = special_char_fix(qsid);
        qpass = special_char_fix(qpass);
        
