Yourigh/A_light/3 - FW SW/2 - Alarm Clock FW ESP8266/_190104_ESP8266_Alight_gitted/src/Alight_main.cpp
byte getOrientation(void)
{
  // accel.readPL() will return a byte containing information
  // about the orientation of the sensor. It will be either
  // PORTRAIT_U, PORTRAIT_D, LANDSCAPE_R, LANDSCAPE_L, or
  // LOCKOUT.
  static byte last_pl = 255;
  byte pl = accel.readPL();
  //Serial.print("PL: ");
  //Serial.println(pl, HEX);
  if (pl != last_pl) {
    switch (pl) {
      case PORTRAIT_U:
      Serial.println("Orientation changed: PORTRAIT_U");
      break;
      case PORTRAIT_D:
      Serial.println("Orientation changed: PORTRAIT_D");
      break;
      case LANDSCAPE_R:
      Serial.println("Orientation changed: LANDSCAPE_R");
      break;
      case LANDSCAPE_L:
      Serial.println("Orientation changed: LANDSCAPE_L");
      break;
      case LOCKOUT:
      Serial.println("Orientation changed: LOCKOUT");
      break;
      default:
      Serial.print("Orientation changed: Unknown (");
      Serial.print(pl, HEX);
      Serial.println(")");
      break;
    }
    last_pl = pl;
  }
  switch (pl)
  {
  case PORTRAIT_U:
    //Serial.print("Portrait Up"); //00
    return 0; 
    break;
  case PORTRAIT_D:
    //Serial.print("Portrait Down"); //02
    return 2;
    break;
  case LANDSCAPE_R:
    //Serial.print("Landscape Right"); //01
    return 1;
    break;
  case LANDSCAPE_L:
    //Serial.print("Landscape Left"); //03
    return 3;
    break;
  case LOCKOUT:
    //Serial.print("Flat");
    return 0;
    break;
  }
  return 0;
}

////////////////////////////////////////////////////
///////////////////DEBUG////////////////////////////
////////////////////////////////////////////////////
#if DEBUG == 1

#endif

void loop() {
  //nothing
}
